yulei/amk/sdk_m480/dcd_m480.c
    while (countdown--) ep->EPDAT_BYTE = *xfer->data_ptr++;
  }

  /* for short packets, we must nudge the peripheral to say 'that's all folks' */
  if (bytes_now != xfer->max_packet_size) ep->EPRSPCTL = HSUSBD_EPRSPCTL_SHORTTXEN_Msk;
}

/* called by dcd_init() as well as by the ISR during a USB bus reset */
static void bus_reset(void)
{
  for (enum ep_enum ep_index = PERIPH_EPA; ep_index < PERIPH_MAX_EP; ep_index++)
  {
    HSUSBD->EP[ep_index].EPCFG = 0;
    xfer_table[ep_index].dma_requested = false;
  }

  HSUSBD->DMACNT = 0;
  HSUSBD->DMACTL = HSUSBD_DMACTL_DMARST_Msk;
  HSUSBD->DMACTL = 0;

  /* allocate the default EP0 endpoints */

  HSUSBD->CEPBUFST = 0;
  HSUSBD->CEPBUFEND = 0 + CFG_TUD_ENDPOINT0_SIZE - 1;

  /* USB RAM beyond what we've allocated above is available to the user */
  bufseg_addr = CFG_TUD_ENDPOINT0_SIZE;

  /* Reset USB device address */
  HSUSBD->FADDR = 0;

  current_dma_xfer = NULL;
}

#if USE_DMA
/* this must only be called by the ISR; it does its best to share the single DMA engine across all user EPs (IN and OUT) */
static void service_dma(void)
{
  if (current_dma_xfer)
    return;

  enum ep_enum ep_index;
  struct xfer_ctl_t *xfer;
  HSUSBD_EP_T *ep;

  for (ep_index = PERIPH_EPA, xfer = &xfer_table[PERIPH_EPA], ep = &USBD->EP[PERIPH_EPA]; ep_index < PERIPH_MAX_EP; ep_index++, xfer++, ep++)
  {
    uint16_t const available_bytes = ep->EPDATCNT & HSUSBD_EPDATCNT_DATCNT_Msk;

    if (!xfer->dma_requested || !available_bytes)
      continue;

    /*
    instruct DMA to copy the data from the PC to the previously provided buffer
    when the bus interrupt DMADONEIEN subsequently fires, the transfer will have finished
    */
    HSUSBD->DMACTL = xfer->ep_addr & HSUSBD_DMACTL_EPNUM_Msk;
    HSUSBD->DMAADDR = (uint32_t)xfer->data_ptr;
    HSUSBD->DMACNT = available_bytes;
    HSUSBD->BUSINTSTS = HSUSBD_BUSINTSTS_DMADONEIF_Msk;
    xfer->out_bytes_so_far += available_bytes;
    current_dma_xfer = xfer;
    HSUSBD->DMACTL |= HSUSBD_DMACTL_DMAEN_Msk;

    return;
  }
}
#endif

/* centralized location for USBD interrupt enable bit masks */
/*
static const uint32_t enabled_irqs = HSUSBD_GINTEN_USBIEN_Msk | \
  HSUSBD_GINTEN_EPAIEN_Msk | HSUSBD_GINTEN_EPBIEN_Msk | HSUSBD_GINTEN_EPCIEN_Msk | HSUSBD_GINTEN_EPDIEN_Msk | HSUSBD_GINTEN_EPEIEN_Msk | HSUSBD_GINTEN_EPFIEN_Msk | \
  HSUSBD_GINTEN_EPGIEN_Msk | HSUSBD_GINTEN_EPHIEN_Msk | HSUSBD_GINTEN_EPIIEN_Msk | HSUSBD_GINTEN_EPJIEN_Msk | HSUSBD_GINTEN_EPKIEN_Msk | HSUSBD_GINTEN_EPLIEN_Msk | \
  HSUSBD_GINTEN_CEPIEN_Msk;
  */

/*
  M484 TinyUSB API driver implementation
*/

void dcd_init(uint8_t rhport)
{
  (void) rhport;

  uint32_t volatile i;
  /* Initial USB engine */
  HSUSBD_ENABLE_PHY();

  /* wait PHY clock ready */
  while (1) {
    HSUSBD->EP[EPA].EPMPS = 0x20UL;

    if (HSUSBD->EP[EPA].EPMPS == 0x20UL) {
      break;
    }
  }

  for (i = 0; i < 0x10000; i++);

  HSUSBD->OPER &= ~HSUSBD_OPER_HISPDEN_Msk;   /* full-speed */

  /* Enable hispeed */
  //HSUSBD->OPER = HSUSBD_OPER_HISPDEN_Msk;

  /* Enable USB BUS, CEP global interrupt */
  HSUSBD_ENABLE_USB_INT(HSUSBD_GINTEN_USBIEN_Msk | HSUSBD_GINTEN_CEPIEN_Msk);

  /* Enable BUS interrupt */
  HSUSBD_ENABLE_BUS_INT(HSUSBD_BUSINTEN_RESUMEIEN_Msk | HSUSBD_BUSINTEN_RSTIEN_Msk | HSUSBD_BUSINTEN_VBUSDETIEN_Msk | HSUSBD_BUSINTEN_SOFIEN_Msk);

  /* Reset Address to 0 */
  HSUSBD_SET_ADDR(0);

  /* Control endpoint */
  HSUSBD->CEPBUFST = 0;
  HSUSBD->CEPBUFEND = 0 + CFG_TUD_ENDPOINT0_SIZE - 1UL;
  bufseg_addr = CFG_TUD_ENDPOINT0_SIZE;
  HSUSBD_ENABLE_CEP_INT(HSUSBD_CEPINTEN_SETUPPKIEN_Msk | HSUSBD_CEPINTEN_STSDONEIEN_Msk | HSUSBD_CEPINTEN_RXPKIEN_Msk | HSUSBD_CEPINTEN_TXPKIEN_Msk);

  NVIC_EnableIRQ(USBD20_IRQn);

  HSUSBD->OPER = HSUSBD_OPER_HISPDEN_Msk;   /* high-speed */
  HSUSBD_CLR_SE0();

  //usb_attach();
}

void dcd_int_enable(uint8_t rhport)
{
  (void) rhport;
  NVIC_EnableIRQ(USBD_IRQn);
}

void dcd_int_disable(uint8_t rhport)
{
  (void) rhport;
  NVIC_DisableIRQ(USBD_IRQn);
}

void dcd_set_address(uint8_t rhport, uint8_t dev_addr)
{
  (void) rhport;
  usb_control_send_zlp(); /* SET_ADDRESS is the one exception where TinyUSB doesn't use dcd_edpt_xfer() to generate a ZLP */
  assigned_address = dev_addr;
}

void dcd_remote_wakeup(uint8_t rhport)
{
  (void) rhport;
  HSUSBD->OPER |= HSUSBD_OPER_RESUMEEN_Msk;
}

bool dcd_edpt_open(uint8_t rhport, tusb_desc_endpoint_t const * p_endpoint_desc)
{
  (void) rhport;

  HSUSBD_EP_T *ep = ep_entry(p_endpoint_desc->bEndpointAddress, true);
  TU_ASSERT(ep);

  /* mine the data for the information we need */
  int const dir = tu_edpt_dir(p_endpoint_desc->bEndpointAddress);
  int const size = tu_edpt_packet_size(p_endpoint_desc);
  tusb_xfer_type_t const type = p_endpoint_desc->bmAttributes.xfer;
  struct xfer_ctl_t *xfer = &xfer_table[ep - HSUSBD->EP];

  /* allocate buffer from USB RAM */
  ep->EPBUFST = bufseg_addr;
  bufseg_addr += size;
  ep->EPBUFEND = bufseg_addr - 1;
  TU_ASSERT(bufseg_addr <= HSUSBD_BUF_SIZE);

  ep->EPMPS = size;

  ep->EPRSPCTL = HSUSBD_EP_RSPCTL_FLUSH | eprspctl_eptype_table[type];

  /* construct USB Configuration Register value and then write it */
  uint32_t num = tu_edpt_number(p_endpoint_desc->bEndpointAddress);
  uint32_t cfg = num << HSUSBD_EPCFG_EPNUM_Pos;
  if (TUSB_DIR_IN == dir)
    cfg |= HSUSBD_EPCFG_EPDIR_Msk;
  cfg |= epcfg_eptype_table[type] | HSUSBD_EPCFG_EPEN_Msk;
  ep->EPCFG = cfg;

  /* make a note of the endpoint particulars */
  xfer->max_packet_size = size;
  xfer->ep_addr = p_endpoint_desc->bEndpointAddress;


  /* enable interrupt */
  HSUSBD->GINTEN |= (0x1UL << (HSUSBD_GINTEN_EPAIEN_Pos + (num - PERIPH_EPA)));
  uint32_t ep_intr = HSUSBD_EPINTEN_TXPKIEN_Msk;
  if (dir == TUSB_DIR_OUT) {
    ep_intr = HSUSBD_EPINTEN_RXPKIEN_Msk | HSUSBD_EPINTEN_SHORTRXIEN_Msk | HSUSBD_EPINTEN_BUFFULLIEN_Msk;
  }

  HSUSBD_ENABLE_EP_INT(num, ep_intr);
  return true;
}

void dcd_edpt_close_all (uint8_t rhport)
{
  (void) rhport;
  // TODO implement dcd_edpt_close_all()
}

bool dcd_edpt_xfer(uint8_t rhport, uint8_t ep_addr, uint8_t *buffer, uint16_t total_bytes)
{
  (void) rhport;

